---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPlacement.UseBalusterPerTreadOnStairs
source: html/c4e88ca4-4f65-9a44-c89c-dc30e40b70ae.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPlacement.UseBalusterPerTreadOnStairs Property

If true, one or more balusters will be included on each tread of an associated stair.
 If false, this is not guaranteed to happen.

## Syntax (C#)
```csharp
public bool UseBalusterPerTreadOnStairs { get; set; }
```